Repository: AndroidCatherine/DataDictionaryCreator
Catalog: DataDictionaryCreator/MainForm.*.resx
Languages: de, fr

# aboutToolStripMenuItem.Text
source: About Data Dictionary Creator
de: Über Data Dictionary Creator
fr: À propos de Data Dictionary Creator

# additionalPropertiesToolStripMenuItem.Text
source: Define Additional Fields
de: Zusätzliche Felder definieren
fr: Définir les champs additionnels

# autoFillKeysToolStripMenuItem.Text
source: Auto Fill Keys
de: Schlüssel automatisch befüllen
fr: Remplissage automatique des clés

# btnAdvancedSettings.Text
source: Advanced Settings
de: Erweiterte Einstellungen
fr: Paramètres avancés

# btnBack.Text
source: Back
de: Zurück
fr: Retour

# btnConnect.Text
source: Connect
de: Verbinden
fr: Connecter

# btnDocumentDatabase.Text
source: Document Database
de: Databank dokumentieren
fr: Documenter la base de données

# btnExit.Text
source: Exit
de: Ende
fr: Sortir

# btnExport.Text
source: Export Now
de: Jetzt exportieren
fr: Exporter

# btnExport.ToolTip
source: You may export your database documentation to various formats.(Word, Excel, HTML, or XML) and a filename to export the data dictionary documentation in tabular format.
de: Sie können ihre Datenbankdokumentation in verschiedene Formate exportieren. (Word, Excel, HTML oder XML) und eine Dateiname zum exportieren der Data Dictionary Dokumentation im Tabellenformat.
fr: Vous pouvez exporter votre documentation sous différents formats. (Word, Excel, HTML ou XML)

# btnImport.Text
source: Import Now
de: Jetzt importieren
fr: Importer

# btnNext.Text
source: Continue
de: Weiter
fr: Continuer

# btnSetKeyDescriptions.Text
source: Auto Fill Descriptions Now
de: Beschreibungen jetzt automatische befüllen
fr: Remplissage automatique

# chkExcludedTable.Text
source: Exclude From Documentation
de: Von Dokumentation ausschließen
fr: Exclure de la documentation

# chkOpenFile.Text
source: Open File After Export
de: Öffne Datei nach Export
fr: Ouvrir le fichier après l'exportation

# chkOverwriteDescriptions.Text
source: Overwrite existing descriptions
de: Überschreibe bestehende Beschreibungen
fr: Écraser les descriptions existantes

# chkOverwriteDescriptions.ToolTip
source: If this is checked, Auto Fill will overwrite descriptions for all keys, even if a previous value has been set.
de: Wenn ausgewählt, dann werden alle Beschreibungen für alle Schlüssel überschrieben.
fr: Si cette case est cochée, le remplissage automatique écrasera les descriptions de toutes les clé, même si une valeur précédente a été fixé.

# connectToDatabaseToolStripMenuItem.Text
source: Connect to Database
de: Verbinde mit Datenbank
fr: Connecter à la base de données

# documentDatabaseToolStripMenuItem.Text
source: Document Database
de: Databank dokumentieren
fr: Documenter la base de données

# exitToolStripMenuItem.Text
source: Exit
de: Ende
fr: Sortir

# fileToolStripMenuItem.Text
source: File
de: Datei
fr: Fichier

# helpToolStripMenuItem.Text
source: Help
de: Hilfe
fr: Aide

# importDocumentationToolStripMenuItem.Text
source: Import Documentation
de: Dokumentation importieren
fr: Importer la documentation

# label1.Text
source: Automatically generate a common description for all Foreign Keys by providing a value below.
de: Beschreibung für alle Fremdschlüssel mit folgendem Wert.
fr: Générer automatiquement une description commune pour toutes les clés étrangères en fournissant une valeur ci-dessous.

# label10.Text
source: Once entered, the additional properties will be available on the Document Database tab.
de: Einmal eingegeben, sind die zusätzlichen Eigenschaften im "Dokumentiere Datenbank" Tab verfügbar
fr: Une fois entrés, les propriétés supplémentaires seront disponibles sous l'onglet "Documenter la base de données".

# label11.Text
source: Specify the Database
de: Datenbank angeben
fr: Spécifier la base de donnés

# label12.Text
source: Import Documentation
de: Dokumentation importieren
fr: Importer la documentation

# label13.Text
source: XML and T-SQL imports are supported.
de: XML und T-SQL Importe werden unterstützt.
fr: L'importation de fichiers XML et T-SQL est supportée.

# label14.Text
source: Word, Excel, HTML, and XML formats are supported.
de: Word, Excel, HTML, und XML Formate werden unterstützt.
fr: Les formats Word, Excel, HTML et XML sont supportés.

# label15.Text
source: T-SQL export is also supported. This will allow you to copy documentation between database instances on different servers.
de: T-SQL Export wird unterstützt. Dies ermöglicht ihnen die Dokumentation zwischen verschiedenen Datenbankinstanzen zu kopieren.
fr: L'exportation T-SQL est également supporté. Cela vous permettra de copier des documents entre les instances de base de données sur différents serveurs.

# label16.Text
source: Export Documentation
de: Dokumentation exportieren
fr: Exporter la documentation

# label17.Text
source: Document Database
de: Databank dokumentieren
fr: Documenter la base de données

# label18.Text
source: Description
de: Beschreibung

# label19.Text
source: View
de: Sicht
fr: Vue

# label2.Text
source: Note, {0} will be replaced by the referenced table name.
de: Merke, {0} wird ersetzt durch den referenzierten Tabellennamen.
fr: Remarque, {0} sera remplacé par le nom de la table référencée.

# label3.Text
source: Document Additonal Properties
de: Dokumentiere zusätzliche Eigenschaften
fr: Documenter les propriétés additionnelles

# label4.Text
source: Table
de: Tabelle

# label5.Text
source: Description
de: Beschreibung

# label6.Text
source: By default, a description may be applied to any database field.
de: Als Default kann eine Beschreibung zu jedem beliebigen Datenbankfeld geschrieben werden
fr: Par défaut, une description peut être appliquée à n'importe quel champs de base de données.

# label7.Text
source: For example: owner, createdate, modifieddate
de: z.B.: owner, createdate, modifieddate
fr: Par exemple: Propriétaire, DateDeCréation, DateDeModification

# label8.Text
source: You may also define your own properties by providing a comma-delimited list of property names below.
de: Sie können eigene Eigenschaften definieren mittels einer Komma-getrennten Liste mit den Namen
fr: Vous pouvez également définir vos propres propriétés en fournissant une liste délimitée par des virgules de noms de propriété ci-dessous.

# label9.Text
source: Primary and Foreign Key Auto Fill
de: Primär- und Fremdschlüssel Auto-Befüllung
fr: Remplissage automatique des clés primaires et étrangères

# lblAutoFill.Text
source: Automatically generate a common description for all Primary Keys by providing a value below.
de: Generiert automatisch eine generelle Beschreibung für alle Primärschlüssel mittels unten angegebenen Wert
fr: Générer automatiquement une description commune pour toutes les clés primaires en fournissant une valeur ci-dessous.

# lblConnectDatabaseInstructions.Text
source: Specify the database you wish to document.
de: Datenbank auswählen die dokumentiert werden soll.
fr: Spécifiez la base de données que vous souhaitez documenter.

# lblConnectionSuccess.Text
source: Connection Success Details...
de: Verbindung erfolgreich Details...

# lblExportInfo.Text
source: Once compiled, database documentation may be exported to various formats.
de: Einmal kompiliert, kann die Dokumentation in verschieden Formate exportiert werden.
fr: Une fois compilé, la documentation de base de données peut être exportés vers différents formats.

# lblImport.Text
source: You may import previously exported database documentation.
de: Sie können eine vorher exportierte Dokumentation auch wieder importieren.
fr: Vous pouvez importer de la documentation de base de données exportée au préalable.

# lnkException.Text
source: Connection Exception Details
de: Verbindungsfehler - Details

# setAdditionalPropertiesToolStripMenuItem.Text
source: Advanced Settings
de: Erweiterte Einstellungen
fr: Paramètres avancés

# tablesToolStripMenuItem.Text
source: Tables
de: Tabellen

# tabPageAdvancedSettings.Text
source: Advanced Settings
de: Erweiterte Einstellungen
fr: Paramètres avancés

# tabPageConnect.Text
source: Connect to Database
de: Verbindung mit Datenbank
fr: Connecter à la base de données

# tabPageDocumentDatabase.Text
source: Document Database
de: Datenbank dokumentieren
fr: Documenter la base de données

# tabPageExportDocumentation.Text
source: Export Documentation
de: Dokumentation exportieren
fr: Exporter la documentation

# tabPageImportDocumentation.Text
source: Import Documentation
de: Dokumentation importieren
fr: Importer la documentation

# tabPageTables.Text
source: Tables
de: Tabellen

# tabPageViews.Text
source: Views
de: Sichten
fr: Vues

# txtAdditionalProperties.ToolTip
source: You can add additional extended properties if you'd like more than the standard "Description" field. Use a comma delimited list (e.g. Source,Audit,Contact).
de: Sie können weitere Eigenschaften angeben, wenn sie mehr als nur Beschreibung brauchen. Nutzen sie eine Kommagetrennte Liste (z.B. Source,Audit,Contract)
fr: Vous pouvez ajouter des propriétés additionnelles si vous souhaitez plus que le champ "Description". Utilisez une liste délimitée par des virgules (e.g. Source, Audit, Contact).

# txtConnectionString.ToolTip
source: Enter a SQL Connection String. Double-click to set via a dialog. If you enter one manually, click the Edit tab to update. Turns blue on successful connection, red if unable to connect.
de: Geben sie einen SQL-Verbindungsstring ein. Doppelklicken um den Dialog zu erreichen. Wenn sie den String manuell eingeben, klicken sie auf den "Bearbeiten" Tab. Blau erscheint bei erfolreicher Verbindung, rot wenn nicht.
fr: Entrez une connexion SQL. Double-cliquez pour définir via un dialogue. Si vous en entrez une manuellement, cliquez sur l'onglet Modifier pour mettre à jour. Vire blue sur une connexion réussie, rouge s'il est incapable de se connecter.

# txtForeignKeyDescription.ToolTip
source: Auto Fill will use this description for all Foreign Keys. Use {0} for the name of the table being linked to.
de: Beschreibung für alle Fremdschlüssel. {0} ist der Name der Tabelle die mit dem Schlüssel verknüpft ist.
fr: Remplissage automatique utilisera cette description pour toutes les clés étrangères. Utilise {0} pour le nom de la table liée.

# txtPrimaryKeyDescription.ToolTip
source: Auto Fill will add this description to all Primary Key columns.
de: Beschreibung für alle Primärschlüssel
fr: Remplissage automatique va ajouter à cette description pour toutes les colonnes clé primaire.

# viewsToolStripMenuItem.Text
source: Views
de: Sichten
fr: Vues

# exportDocumentationToolStripMenuItem.Text
source: Export Documentation
fr: Exporter la documentation
